# Задание 1

**Шаг 1** Импортируйте необходимые библиотеки

In [2]:
import pandas as pd
import seaborn as sns
import numpy as np
import warnings 
import py_linq
from github.MainClass import Github
from matplotlib import pyplot as plt
warnings.simplefilter("ignore")
from sklearn.model_selection import train_test_split
from sklearn.model_selection import cross_val_score
from sklearn.svm import SVC
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import GridSearchCV
from sklearn.neural_network import MLPClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.ensemble import GradientBoostingClassifier

**Шаг 2** Импортируйте набор данных с https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user

import requests
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
response = requests.get(url)

**Шаг 3** Назначьте его переменной с именем users и используйте user_id в качестве индекса

In [3]:
users = pd.read_csv('users.csv', sep='|')
users.set_index('user_id', inplace=True)

**Шаг 4** См. Первые 25 записей

In [26]:
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

**Шаг 5** Просмотрите последние 10 записей

In [35]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

**Шаг 6** Какое количество наблюдений в наборе данных?

In [5]:
users.shape[0]

943

**Шаг 7** Какое количество столбцов в наборе данных?

In [27]:
len(users.columns)

4

**Шаг 8** Распечатайте названия всех столбцов.

In [36]:
for _ in range(len(users.columns)):
    print(users.columns[_], end = ", ")

age, gender, occupation, zip_code,

**Шаг 9** Как индексируется набор данных?

In [6]:
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

**Шаг 10** Каков тип данных каждого столбца?

In [9]:
#users.info()
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

**Шаг 11** Распечатайте только столбец профессии

In [31]:
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

**Шаг 12** Сколько разных профессий в этом наборе данных?

Узнаем количество пустых значений

In [34]:
users.isna().sum()

age           0
gender        0
occupation    0
zip_code      0
dtype: int64

In [11]:
len(users['occupation'].value_counts())

21

**Шаг 13** Какое занятие чаще всего?

In [16]:
users['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

**Шаг 14** Обобщите DataFrame.

In [18]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

**Шаг 15** Суммируйте все столбцы

In [19]:
users.describe(include='all').T

,count,unique,top,freq,mean,std,min,25%,50%,75%,max
age,943.0,NaN,NaN,NaN,34.051962,12.19274,7.0,25.0,31.0,43.0,73.0
gender,943,2,M,670,NaN,NaN,NaN,NaN,NaN,NaN,NaN
occupation,943,21,student,196,NaN,NaN,NaN,NaN,NaN,NaN,NaN
zip_code,943,795,55414,9,NaN,NaN,NaN,NaN,NaN,NaN,NaN

**Шаг 16** Подведите итоги только по столбцу род занятий

In [20]:
users['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

**Шаг 17** Каков средний возраст пользователей?

In [21]:
round(users['age'].mean())

34

**Шаг 18** В каком возрасте встречается меньше всего?

In [25]:
users.age.value_counts().tail() #head - наиболее встречающиеся

7     1
66    1
10    1
11    1
73    1
Name: age, dtype: int64

# Задание 2

**Step 2** This is the data given as a dictionary

**Step 3** Create a dataframe and assign it to a variable called army

**Step 4** Set the 'origin' colum as the index of the dataframe

In [27]:
raw_data  = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
            'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'],
            'deaths': [523, 52, 25, 616, 43, 234, 523, 62, 62, 73, 37, 35],
            'battles': [5, 42, 2, 2, 4, 7, 8, 3, 4, 7, 8, 9],
            'size': [1045, 957, 1099, 1400, 1592, 1006, 987, 849, 973, 1005, 1099, 1523],
            'veterans': [1, 5, 62, 26, 73, 37, 949, 48, 48, 435, 63, 345],
            'readiness': [1, 2, 3, 3, 2, 1, 2, 3, 2, 1, 2, 3],
            'armored': [1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 1, 1],
            'deserters': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
            'origin': ['Arizona', 'California', 'Texas', 'Florida', 'Maine', 'Iowa', 'Alaska', 'Washington', 'Oregon', 'Wyoming', 'Louisana', 'Georgia']}

In [28]:
army = pd.DataFrame.from_dict(raw_data) #army = pd.DataFrame(data = raw_data)

In [35]:
army.set_index('origin', inplace=True)

KeyError: "None of ['origin'] are in the columns"

**Step 5** Print only the column veterans

In [7]:
army['veterans']

origin
Arizona         1
California      5
Texas          62
Florida        26
Maine          73
Iowa           37
Alaska        949
Washington     48
Oregon         48
Wyoming       435
Louisana       63
Georgia       345
Name: veterans, dtype: int64

**Step 6** Print the columns 'veterans' and 'deaths'

In [8]:
army[['veterans', 'deaths']]

            veterans  deaths
origin
Arizona            1     523
California         5      52
Texas             62      25
Florida           26     616
Maine             73      43
Iowa              37     234
Alaska           949     523
Washington        48      62
Oregon            48      62
Wyoming          435      73
Louisana          63      37
Georgia          345      35

**Step 7** Print the name of all the columns.

In [32]:
#for i in range(len(army.columns)):
    #print(army.columns[i], end= ", ")
army.columns

Index(['regiment', 'company', 'deaths', 'battles', 'size', 'veterans',
       'readiness', 'armored', 'deserters'],
      dtype='object')

**Step 8** Select the 'deaths', 'size' and 'deserters' columns from Maine and Alaska

In [23]:
army.loc[['Maine','Alaska'], ['deaths', 'size', 'deserters']]

        deaths  size  deserters
origin
Maine       43  1592          3
Alaska     523   987         24

**Step 9** Select the rows 3 to 7 and the columns 3 to 6

In [34]:
army.iloc[3:8, 3:7]

            battles  size  veterans  readiness
origin
Florida           2  1400        26          3
Maine             4  1592        73          2
Iowa              7  1006        37          1
Alaska            8   987       949          2
Washington        3   849        48          3

**Step 10** Select every row after the fourth row and all columns

In [38]:
army.iloc[5:, :]

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Iowa,Dragoons,1st,234,7,1006,37,1,1,4
Alaska,Dragoons,2nd,523,8,987,949,2,0,24
Washington,Dragoons,2nd,62,3,849,48,3,1,31
Oregon,Scouts,1st,62,4,973,48,2,0,2
Wyoming,Scouts,1st,73,7,1005,435,1,0,3
Louisana,Scouts,2nd,37,8,1099,63,2,1,2
Georgia,Scouts,2nd,35,9,1523,345,3,1,3

**Step 11** Select every row up to the 4th row and all columns

In [39]:
army.iloc[:4, :]

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523,5,1045,1,1,1,4
California,Nighthawks,1st,52,42,957,5,2,0,24
Texas,Nighthawks,2nd,25,2,1099,62,3,1,31
Florida,Nighthawks,2nd,616,2,1400,26,3,1,2

**Step 12** Select the 3rd column up to the 7th column

In [39]:
army.iloc[:,2:7].columns

Index(['deaths', 'battles', 'size', 'veterans', 'readiness'], dtype='object')

**Step 13** Select rows where df.deaths is greater than 50

In [54]:
army[army['deaths'] > 50]

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523,5,1045,1,1,1,4
California,Nighthawks,1st,52,42,957,5,2,0,24
Florida,Nighthawks,2nd,616,2,1400,26,3,1,2
Iowa,Dragoons,1st,234,7,1006,37,1,1,4
Alaska,Dragoons,2nd,523,8,987,949,2,0,24
Washington,Dragoons,2nd,62,3,849,48,3,1,31
Oregon,Scouts,1st,62,4,973,48,2,0,2
Wyoming,Scouts,1st,73,7,1005,435,1,0,3

**Step 14** Select rows where df.deaths is greater than 500 or less than 50

In [8]:
army[(army['deaths'] > 500) | (army['deaths'] < 50)]

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523,5,1045,1,1,1,4
Texas,Nighthawks,2nd,25,2,1099,62,3,1,31
Florida,Nighthawks,2nd,616,2,1400,26,3,1,2
Maine,Dragoons,1st,43,4,1592,73,2,0,3
Alaska,Dragoons,2nd,523,8,987,949,2,0,24
Louisana,Scouts,2nd,37,8,1099,63,2,1,2
Georgia,Scouts,2nd,35,9,1523,345,3,1,3

**Step 15** Select all the regiments not named "Dragoons"

In [40]:
army[army['regiment'] != 'Dragoons']

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Arizona,Nighthawks,1st,523,5,1045,1,1,1,4
California,Nighthawks,1st,52,42,957,5,2,0,24
Texas,Nighthawks,2nd,25,2,1099,62,3,1,31
Florida,Nighthawks,2nd,616,2,1400,26,3,1,2
Oregon,Scouts,1st,62,4,973,48,2,0,2
Wyoming,Scouts,1st,73,7,1005,435,1,0,3
Louisana,Scouts,2nd,37,8,1099,63,2,1,2
Georgia,Scouts,2nd,35,9,1523,345,3,1,3

**Step 16** Select the rows called Texas and Arizona

In [14]:
army.loc[['Texas', 'Arizona']]

,regiment,company,deaths,battles,size,veterans,readiness,armored,deserters
origin,,,,,,,,,
Texas,Nighthawks,2nd,25,2,1099,62,3,1,31
Arizona,Nighthawks,1st,523,5,1045,1,1,1,4

**Step 17** Select the third cell in the row named Arizona

In [46]:
army.loc[['Arizona']].iloc[:, 2]  #army.loc['Arizona'][2]

523

**Step 18** Select the third cell down in the column named deaths

In [43]:
army.loc[:, ['deaths']].iloc[2] #продумать варианты

deaths    25
Name: Texas, dtype: int64

# Задание 3

**Step 1** Import the necessary libraries


**Step 2** Import the dataset from this address


**Step 3** Assign it to a variable called drinks

In [48]:
drinks = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv')

In [49]:
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

**Step 4** Which continent drinks more beer on average?

In [63]:
#drinks[['country','beer_servings']].max()
#drinks[['continent', 'country' ,'beer_servings']].value_counts().head()
drinks.groupby('continent').beer_servings.max().head(1)

continent
AF    376
Name: beer_servings, dtype: int64

**Step 5** For each continent print the statistics for wine consumption.

In [73]:
drinks.groupby('continent')[['wine_servings']].describe().T

continent                    AF          AS          EU         OC          SA
wine_servings count   53.000000   44.000000   45.000000   16.00000   12.000000
              mean    16.264151    9.068182  142.222222   35.62500   62.416667
              std     38.846419   21.667034   97.421738   64.55579   88.620189
              min      0.000000    0.000000    0.000000    0.00000    1.000000
              25%      1.000000    0.000000   59.000000    1.00000    3.000000
              50%      2.000000    1.000000  128.000000    8.50000   12.000000
              75%     13.000000    8.000000  195.000000   23.25000   98.500000
              max    233.000000  123.000000  370.000000  212.00000  221.000000

**Step 6** Print the mean alcohol consumption per continent for every column

In [77]:
drinks.groupby('continent').mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

**Step 7** Print the median alcohol consumption per continent for every column

In [78]:
drinks.groupby('continent').median()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

**Step 8** Print the mean, min and max values for spirit consumption.

In [79]:
drinks.groupby('continent').spirit_servings.agg(['mean', 'min', 'max'])

                 mean  min  max
continent
AF          16.339623    0  152
AS          60.840909    0  326
EU         132.555556    0  373
OC          58.437500    0  254
SA         114.750000   25  302

# Задание 4

**Step 3** Assign each to a variable called data1, data2, data3


**Step 4** Join the two dataframes along rows and assign all_data

In [117]:
dict_data_1 = {
        'subject_id': ['0','1', '2', '3', '4', '5'],
        'first_name': ['X','Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'], 
        'last_name': ['Y','Anderson', 'Ackerman', 'Ali', 'Aoni', 'Atiches']}

dict_data_2 = {
        'subject_id': ['0','4', '5', '6', '7', '8'],
        'first_name': ['X','Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Y','Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}

dict_data_3 = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_id': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}

In [118]:
data = pd.DataFrame(data = dict_data_1)
data2 = pd.DataFrame(data = dict_data_2)
data3 = pd.DataFrame(data = dict_data_3)

In [103]:
data

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches

In [104]:
data2

  subject_id first_name last_name
0          4      Billy    Bonder
1          5      Brian     Black
2          6       Bran   Balwner
3          7      Bryce     Brice
4          8      Betty    Btisan

In [98]:
all_data = pd.concat([data, data2])
all_data.reset_index(inplace=True, drop=True)
#all_data.drop(['index'], inplace=True, axis=1)
all_data

  subject_id first_name last_name
0          1       Alex  Anderson
1          2        Amy  Ackerman
2          3      Allen       Ali
3          4      Alice      Aoni
4          5     Ayoung   Atiches
5          4      Billy    Bonder
6          5      Brian     Black
7          6       Bran   Balwner
8          7      Bryce     Brice
9          8      Betty    Btisan

**Step 5** Join the two dataframes along columns and assing to all_data_col

In [99]:
all_data_col = pd.concat([data, data2], axis=1)
all_data_col

  subject_id first_name last_name subject_id first_name last_name
0          1       Alex  Anderson          4      Billy    Bonder
1          2        Amy  Ackerman          5      Brian     Black
2          3      Allen       Ali          6       Bran   Balwner
3          4      Alice      Aoni          7      Bryce     Brice
4          5     Ayoung   Atiches          8      Betty    Btisan

**Step 6** Print data3

In [100]:
data3

  subject_id  test_id
0          1       51
1          2       15
2          3       15
3          4       61
4          5       16
5          7       14
6          8       15
7          9        1
8         10       61
9         11       16

**Step 7** Merge all_data and data3 along the subject_id value

In [101]:
pd.merge(all_data, data3, on='subject_id')

  subject_id first_name last_name  test_id
0          1       Alex  Anderson       51
1          2        Amy  Ackerman       15
2          3      Allen       Ali       15
3          4      Alice      Aoni       61
4          4      Billy    Bonder       61
5          5     Ayoung   Atiches       16
6          5      Brian     Black       16
7          7      Bryce     Brice       14
8          8      Betty    Btisan       15

**Step 8** Merge only the data that has the same 'subject_id' on both data1 and data2

In [102]:
pd.merge(data, data2, on='subject_id')

  subject_id first_name_x last_name_x first_name_y last_name_y
0          4        Alice        Aoni        Billy      Bonder
1          5       Ayoung     Atiches        Brian       Black

**Step 9** Merge all values in data1 and data2, with matching records from both sides where available.

In [119]:
pd.merge(data, data2) #Добавление данных, так как в изначальных не было matches

  subject_id first_name last_name
0          0          X         Y